#### INavisworksExporter Members

---

|  |
| --- |
| INavisworksExporter Interface   Methods   See Also |

The  INavisworksExporter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Export | The method that Revit will invoke to perform an export to Navisworks. |
| Public method | GetDescription | Implement this method to return a description of the server. (Inherited from  IExternalServer  .) |
| Public method | GetName | Implement this method to return the name of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServerId | Implement this method to return the id of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServiceId | Implement this method to return the id of the service. (Inherited from  IExternalServer  .) |
| Public method | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from  IExternalServer  .) |
| Public method | ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

# See Also

INavisworksExporter Interface

Autodesk.Revit.DB Namespace